[
  {
    "id": 1,
    "category": "Iftar",
    "arabic": "اللَّهُمَّ إِنِّي لَكَ صُمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ",
    "bangla_pronunciation": "আল্লাহুম্মা ইন্নি লাকা সুমতু, ওয়া বিকা আমানতু, ওয়া আলাইকা তাওয়াক্কালতু, ওয়া আলা রিযকিকা আফতারতু।",
    "bangla_meaning": "হে আল্লাহ! আমি তোমারই সন্তুষ্টির জন্য রোজা রেখেছি এবং তোমারই দেয়া রিযিক দ্বারা ইফতার করছি।"
  },
  {
    "id": 2,
    "category": "Sehri",
    "arabic": "وَبِصَوْمِ غَدٍ نَوَيْتُ مِنْ شَهْرِ رَمَضَانَ",
    "bangla_pronunciation": "ওয়া বিসাওমি গাদিন নাওয়াইতু মিন শাহরি রামাদ্বান।",
    "bangla_meaning": "আমি রমজান মাসের আগামীকালের রোজার নিয়ত করছি।"
  },
  {
    "id": 3,
    "category": "Morning",
    "arabic": "اَلْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْرِهِ",
    "bangla_pronunciation": "আলহামদু লিল্লা-হিল্লাযী আ-ফা-নী ফী জাসাদী ওয়া রাদ্দা ‘আলাইয়্যা রূহী ওয়া আযিনা লী বিযিকরিহী।",
    "bangla_meaning": "সমস্ত প্রশংসা সেই আল্লাহর জন্য, যিনি আমাকে শারীরিক সুস্থতা দিয়েছেন, আমার রুহ আমাকে ফিরিয়ে দিয়েছেন এবং আমাকে তাঁর যিকির করার অনুমতি দিয়েছেন।"
  },
  {
    "id": 4,
    "category": "Evening",
    "arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ",
    "bangla_pronunciation": "আমসাইনা ওয়া আমসাল মুলকু লিল্লাহি ওয়াল হামদু লিল্লাহ। লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু।",
    "bangla_meaning": "আমরা সন্ধ্যা বরণ করলাম এবং সমস্ত রাজত্ব আল্লাহর। সকল প্রশংসা আল্লাহর। তিনি ছাড়া কোনো ইলাহ নেই, তাঁর কোনো অংশীদার নেই।"
  },
  {
    "id": 5,
    "category": "Before Sleep",
    "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا",
    "bangla_pronunciation": "বিসমিকা আল্লাহুম্মা আমুতু ওয়া অহইয়া।",
    "bangla_meaning": "হে আল্লাহ! তোমার নামে আমি মৃত্যুবরণ করছি এবং বাঁচছি।"
  },
  {
    "id": 6,
    "category": "Eating",
    "arabic": "بِسْمِ اللهِ",
    "bangla_pronunciation": "বিসমিল্লাহ।",
    "bangla_meaning": "আল্লাহর নামে (খাবার শুরু করছি)।"
  },
  {
    "id": 7,
    "category": "After Eating",
    "arabic": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
    "bangla_pronunciation": "আলহামদু লিল্লাহিল্লাযী আত্ব'আমানী হাযা ওয়া রাযাকানীহী মিন গাইরি হাওলিম মিন্নী ওয়া লা কুওয়্যাহ।",
    "bangla_meaning": "সমস্ত প্রশংসা আল্লাহর, যিনি আমাকে এ খাবার খাওয়ালেন ও রিযিক দান করলেন, আমার কোনো শক্তি বা সামর্থ্য ছাড়াই।"
  },
  {
    "id": 8,
    "category": "Travel",
    "arabic": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ",
    "bangla_pronunciation": "সুবহানাল্লাযী সাখখারা লানা হাযা ওয়া মা কুন্না লাহু মুক্বরিনীন। ওয়া ইন্না ইলা রাব্বিনা লামুনক্বালিবূন।",
    "bangla_meaning": "পবিত্র তিনি, যিনি আমাদের জন্য এটা (যানবাহন) নিয়ন্ত্রণে এনেছেন। আমরা এর সামর্থ্য রাখতাম না। নিশ্চয় আমরা আমাদের রবের দিকেই ফিরে যাব।"
  },
  {
    "id": 9,
    "category": "Entering Mosque",
    "arabic": "اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
    "bangla_pronunciation": "আল্লাহুম্মাফ তাহলী আবওয়াবা রাহমাতিক।",
    "bangla_meaning": "হে আল্লাহ! আমার জন্য তোমার রহমতের দরজাসমূহ খুলে দিন।"
  },
  {
    "id": 10,
    "category": "Leaving Mosque",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
    "bangla_pronunciation": "আল্লাহুম্মা ইন্নী আসআলুকা মিন ফাদ্বলিক।",
    "bangla_meaning": "হে আল্লাহ! আমি তোমার অনুগ্রহ প্রার্থনা করছি।"
  },
  {
    "id": 11,
    "category": "After Wudu",
    "arabic": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
    "bangla_pronunciation": "আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু। ওয়া আশহাদু আন্না মুহাম্মাদান 'আবদুহু ওয়া রাসূলুহু।",
    "bangla_meaning": "আমি সাক্ষ্য দিচ্ছি যে আল্লাহ ছাড়া কোনো ইলাহ নেই, তিনি এক, তাঁর কোনো অংশীদার নেই। এবং আমি সাক্ষ্য দিচ্ছি যে মুহাম্মাদ তাঁর বান্দা ও রাসূল।"
  },
  {
    "id": 12,
    "category": "Entering Home",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَوْلِجِ وَخَيْرَ الْمَخْرَجِ بِسْمِ اللهِ وَلَجْنَا وَبِسْمِ اللهِ خَرَجْنَا وَعَلَى اللهِ رَبِّنَا تَوَكَّلْنَا",
    "bangla_pronunciation": "বিসমিল্লাহি ওয়ালাজনা ওয়া বিসমিল্লাহি খারাজনা ওয়া আলাল্লাহি রাব্বিনা তাওয়াক্কালনা।",
    "bangla_meaning": "আল্লাহর নামে আমরা প্রবেশ করলাম এবং আল্লাহর নামে বের হলাম। আর আমাদের রব আল্লাহর উপর আমরা ভরসা করলাম।"
  },
  {
    "id": 13,
    "category": "Seeing Moon",
    "arabic": "اللَّهُمَّ أَهْلِلْهُ عَلَيْنَا بِالْيُمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ رَبِّي وَرَبُّكَ اللهُ",
    "bangla_pronunciation": "আল্লাহুম্মা আহিল্লাহু আলাইনা বিল ইউমনি ওয়াল ঈমানি ওয়াস সালামাতি ওয়াল ইসলাম। রাব্বী ওয়া রাব্বুকাল্লাহু।",
    "bangla_meaning": "হে আল্লাহ! এ চাঁদ আমাদের উপর উদিত কর বরকত, ঈমান, নিরাপত্তা ও ইসলামের সাথে। আমার ও এ চাঁদের রব আল্লাহ।"
  },
  {
    "id": 14,
    "category": "Distress",
    "arabic": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    "bangla_pronunciation": "লা ইলাহা ইল্লা আনতা সুবহানাকা ইন্নী কুন্তু মিনায য্বালিমীন।",
    "bangla_meaning": "তুমি ছাড়া কোনো ইলাহ নেই। তুমি পবিত্র। নিশ্চয় আমি যালিমদের অন্তর্ভুক্ত ছিলাম।"
  },
  {
    "id": 15,
    "category": "After Sneezing",
    "arabic": "الْحَمْدُ لِلَّهِ",
    "bangla_pronunciation": "আলহামদু লিল্লাহ।",
    "bangla_meaning": "সমস্ত প্রশংসা আল্লাহর।"
  },
  {
    "id": 16,
    "category": "Morning Remembrance",
    "arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ",
    "bangla_pronunciation": "আসবাহনা ওয়া আসবাহাল মুলকু লিল্লাহি ওয়াল হামদু লিল্লাহ। লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু।",
    "bangla_meaning": "আমরা সকাল বরণ করলাম এবং সমস্ত রাজত্ব আল্লাহর। সকল প্রশংসা আল্লাহর। তিনি ছাড়া কোনো ইলাহ নেই।"
  },
  {
    "id": 17,
    "category": "Before Fajr",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلًا مُتَقَبَّلًا",
    "bangla_pronunciation": "আল্লাহুম্মা ইন্নী আসআলুকা ইলমান নাফিআন ওয়া রিযক্বান ত্বাইয়্যিবান ওয়া আমালান মুতাক্বাব্বালা।",
    "bangla_meaning": "হে আল্লাহ! আমি আপনার কাছে উপকারী জ্ঞান, পবিত্র রিযিক ও কবুলযোগ্য আমল চাই।"
  },
  {
    "id": 18,
    "category": "General",
    "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "bangla_pronunciation": "রাব্বানা আতিনা fid দুনিয়া হাসানাতান ওয়া ফিল আখিরাতি হাসানাতান ওয়া ক্বিনা আযাবান নার।",
    "bangla_meaning": "হে আমাদের রব! আমাদের দুনিয়াতে ভালো দান করুন এবং আখিরাতেও ভালো দান করুন এবং আমাদের জাহান্নামের শাস্তি থেকে রক্ষা করুন।"
  },
  {
    "id": 19,
    "category": "Thankfulness",
    "arabic": "الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ",
    "bangla_pronunciation": "আলহামদু লিল্লাহিল্লাযী বিনি'মাতিহী তাতিম্মুস সালিহাত।",
    "bangla_meaning": "সমস্ত প্রশংসা আল্লাহর, যার অনুগ্রহে সৎকাজসমূহ সম্পন্ন হয়।"
  },
  {
    "id": 20,
    "category": "Protection",
    "arabic": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "bangla_pronunciation": "আঊযু বিকালিমাতিল্লাহিত তাম্মাতি মিন শাররি মা খালাক্ব।",
    "bangla_meaning": "আল্লাহর পরিপূর্ণ বাণীসমূহের দ্বারা তাঁর সৃষ্টির অনিষ্ট থেকে আশ্রয় প্রার্থনা করছি।"
  }
]
